app/controllers/songs_controller.rb

SELECT `songs`.* FROM `songs` WHERE (`songs`.`user_id` = 1 OR `songs`.`public` = 0)
---
  def index
    @songs = Song.where(user_id: current_user.id).or(Song.where(public: "yes"))

INSERT INTO `songs` (`title`, `author`, `time`, `user_id`, `created_at`, `updated_at`, `public`, `text`) VALUES ('sdsd', 'sdsd', 1.0, 1, '2019-06-14 11:11:21.110184', '2019-06-14 11:11:21.110184', 0, 'cvhujvudvbnyudvnbddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd')
---
  def create
    @song = Song.new(song_params)
    @song.user_id = current_user.id

    respond_to do |format|
      if @song.save

UPDATE `songs` SET `songs`.`time` = 1.2, `songs`.`updated_at` = '2019-06-14 10:34:42.667123' WHERE `songs`.`id` = 5
---
  def update
    respond_to do |format|
      if @song.update(song_params)

DELETE FROM `songs` WHERE `songs`.`id` = 2
---
  def destroy
    @song.destroy

SELECT `songs`.* FROM `songs` WHERE (`songs`.`user_id` = 2 OR `songs`.`public` = 0)
---
  def random_song
    random_song = Song.where(user_id: current_user.id).or(Song.where(public: "yes")).map {|song| song.id}.sample

SELECT `songs`.* FROM `songs` WHERE `songs`.`id` = NULL LIMIT 1
---
    def set_song
      @song = Song.find(params[:id])